# StructuralBeamStartAttachmentType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBeamStartAttachmentType Property
ParameterTypeId Class See Also
---
"Start Attachment Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBeamStartAttachmentType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBeamStartAttachmentType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBeamStartAttachmentType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace